# Core CLI for a fast frontend/RN/Expo terminal.
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fzf"
brew "gh"
brew "rbenv"
brew "ripgrep"
brew "stow"
brew "volta"
brew "watchman"
brew "zoxide"

# Optional local-device and utility tools currently installed.
brew "emojify"
brew "scrcpy"
brew "rtk"

# Apps currently installed through Homebrew Cask.
cask "codex"
cask "codexbar"
cask "android-platform-tools"
cask "android-studio"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty"
cask "ngrok"
cask "raycast"
cask "zulu@17"
