# Core CLI for a fast frontend/RN/Expo terminal.
brew "bat"
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "gitleaks"
brew "opencode"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "volta"
brew "watchman"
brew "zoxide"

# Optional local-device and utility tools currently installed.
brew "emojify"
brew "scrcpy"
brew "rtk"

# Apps currently installed through Homebrew Cask.
cask "codex"
cask "codexbar"
cask "android-platform-tools"
cask "android-studio"
cask "brave-browser"
cask "cloudflare-warp"
cask "cursor"
cask "expo-orbit"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "ngrok"
cask "proxyman"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "zen"
cask "zulu@17"

# VS Code extensions (kept in sync with editors/vscode-extensions.txt;
# Cursor extensions are installed separately via scripts/install-editor-extensions.sh
# since `brew bundle` has no Cursor equivalent).
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "blazejkustra.react-compiler-marker"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
vscode "xabikos.reactsnippets"
vscode "zhuangtongfa.material-theme"
