adpyke.codesnap
anysphere.remote-ssh
blazejkustra.react-compiler-marker
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
msjsdiag.vscode-react-native
naumovs.color-highlight
oxc.oxc-vscode
pkief.material-icon-theme
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
usernamehw.errorlens
wix.vscode-import-cost
zhuangtongfa.material-theme
