adpyke.codesnap
anthropic.claude-code
blazejkustra.react-compiler-marker
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
figma.figma-vscode-extension
msjsdiag.vscode-react-native
naumovs.color-highlight
openai.chatgpt
oxc.oxc-vscode
pkief.material-icon-theme
ritwickdey.liveserver
simonsiefke.svg-preview
streetsidesoftware.code-spell-checker
usernamehw.errorlens
wix.vscode-import-cost
xabikos.reactsnippets
zhuangtongfa.material-theme
